{
  "description": "What are stablecoins? What do they do in DeFi? Why do people mint stablecoins? Where are stablecoins as if Nov 2022?",
  "content": "What Is a Stablecoin? (But Actually)\n  ====================================\n  \n  **What are stablecoins? What do they do in DeFi? Why do people mint stablecoins? Where are stablecoins right now?**\n  -------------------------------------------------------------------------------------------------------------------\n  \n  You can watch the video on the topic on ChainDev\n  \n  _Thanks to_ [_ChainlinkGod_](https://twitter.com/ChainLinkGod)_,_ [_Luca Prosperi_](https://substack.com/profile/33975085-luca-prosperi)_,_ [_Zubin Pratap_](https://twitter.com/ZubinPratap)_, and_ [_Gerrit Hall_](https://www.linkedin.com/in/gerrithall/) _for their help on this article._\n  \n  _For those looking for some code, we have a_ [_stablecoins folder in the defi-minimal project._](https://github.com/smartcontractkit/defi-minimal/tree/main/contracts/stablecoins)\n  \n  _This blog was originallly posted on_ [_blog.chain.link_](https://blog.chain.link/stablecoins-but-actually/)\n  \n  Introduction\n  ------------\n  \n  When you look up “what is a stablecoin” you get a lot of *pushes glasses up* wrong or misleading information.\n  \n  The wrong and misleading information is:\n  \n  1.  All stablecoins are pegged/anchored to that of another asset/currency\n  2.  All stablecoins fall into the categories of fiat-collateralized, crypto-collateralized, and algorithmic\n  \n  And I’m here to straighten the record and tell you EVERYTHING you need to know to really understand stablecoins. What are stablecoins, what they do in DeFi, why they are so important, and where they are right now.\n  \n  And additionally, probably the most important and interesting part of the picture, how stablecoins are created and the economics behind them. This isn’t your average stablecoin article, but your end-to-end mega stablecoin article.\n  \n  Buckle up, because we are in for a volatile ride about stability.\n  \n  Table of Contents\n  =================\n  \n  *   What is a stablecoin?\n  *   Why do we care?\n  *   Categories and anatomy\n  *   A look at various modern coins\n  *   Who pays for stablecoins?\n  *   What’s the deal with curve wars?\n  *   Final thoughts\n  \n  What Is a Stablecoin?\n  =====================\n  \n  **A stablecoin is a non-volatile crypto asset.**\n  \n  That’s it.\n  \n  If you take away anything from this article, please, have it be this:\n  \n  A stablecoin is any crypto asset whose buying power fluctuates very little relative to the rest of the market.\n  \n  “Non-volatile” means that a crypto asset’s **buying power** will stay **similar** for a **long** duration of time. “Similar” and “long” are subjective terms, so we’ve already learned that a stablecoin is subjective from person to person! Stable to you might not be so stable to someone else.\n  \n  “Buying Power” is how much a currency can buy. If one dollar can buy you a box of apples today and in ten years, we would say the buying power of that currency stayed stable over 10 years. If after ten years one dollar could only buy half a box of apples, we’d say the buying power of the dollar was cut in half. We give more buying examples later in this blog.\n  \n  An asset whose price jumps up and down would not be considered a stablecoin. Most crypto assets are volatile in nature or have the capacity to be volatile.\n  \n  The second most important takeaway is this:\n  \n  Almost every question you have about the purpose of stablecoins can be answered by swapping out the word “stablecoin” for “dollar” in your question, and asking “well, how does a dollar, Euro, or Yen handle that?”\n  \n  For example:\n  \n  Question: Why are **stablecoins** important?\n  \n  Has nearly the same answer as:\n  \n  Question: Why are **dollars** important?\n  \n  Why Do We Care?\n  ===============\n  \n  In our daily lives, a low-volatility currency is very important for three reasons:\n  \n  1.  **Storage of Value:** So that we can build wealth or bartering power. Having your dollars in a bank account is using them as a store of value.\n  2.  **Unit of Account:** A way to measure how valuable things are. Like when you go to the store and see goods listed in terms of dollars. Dollars are acting like a unit of account.\n  3.  **Medium of Exchange:** An agreed-upon method to transact between each other. When you use a currency to purchase items, you’re using it as a medium of exchange.\n  \n  In order for our everyday lives to be efficient, it’s good to have a currency or coin that accomplishes these three goals. Most crypto assets like Ether or Bitcoin don’t accomplish all three goals very well. Now some would argue they are good at all three, but I’m quite certain that they do a terrible job of at least **unit of account**.\n  \n  If I were to go to the Crypto Amazon online store and we had Ethereum or Bitcoin as the unit of account, based on the day of the week the prices could be twice what they were the week before. This high volatility makes for a poor unit of account.\n  \n  Now, an average stablecoin article would stop there, or go deep into the history of money, but we have bigger plans… Let’s look at what a stablecoin looks like, then we will jump down to the top stablecoins.\n  \n  If this next section is a little confusing, feel free to skip down to the top stablecoins section.\n  \n  Categories and Anatomy\n  ======================\n  \n  Now in order to make or use a stablecoin, you have to understand the 3 main categories of a stablecoin.\n  \n  1.  **Relative Stability.** Pegged/anchored or floating.\n  2.  **Stability Method.** Governed or algorithmic.\n  3.  **Collateral Type.** Endogenous or exogenous.\n  \n  These categories are each spectrums, meaning a coin can be more algorithmic or more governed by its stability method. It can be more exogenous or more endogenous for its collateral type. And more pegged or more floating depending on its implementation.\n  \n  Let’s understand each of these categories and the tokens that fall into them.\n  \n  Relative Stability\n  ==================\n  \n  As mentioned above, a stablecoin is only stable as a relative term, so we need to know what we are comparing our stablecoin to that makes them stable.\n  \n  Pegging/Anchoring\n  -----------------\n  \n  One of the easiest ways to make a stablecoin would be to back it by or peg it to another asset that most people consider “non-volatile.” So yes, _some_ stablecoins are pegged to another asset, but not all (more on that later). The most popular asset most people choose is the US dollar. Many stablecoins like [USDT](https://www.investopedia.com/terms/t/tether-usdt.asp), [DAI](https://makerdao.com/en/), and [USDC](https://www.investopedia.com/usd-coin-5210435) follow this strategy.\n  \n  A stablecoin that is “pegged” or “anchored” to another asset is a stablecoin that follows the buying power of another asset that people consider to be stable, like the Dollar, Euro, or Yen.\n  \n  They then follow the narrative of:\n  \n  One Dollar-Pegged Coin (USDT, DAI, or USDC) = $1\n  \n  Which is easy for people to understand. The way pegged stablecoins work is they have a smart contract or service which says at any time (usually any time) you can swap your coin for its underlying collateral. With our dollar-pegged stablecoins, you can swap your DAI, USDC, or USDT for the dollar equivalent.\n  \n  For example, with DAI, the protocol enables you to trade your DAI in for your ETH collateral at any time, at an exchange rate of exactly $1 of collateral per 1 DAI. So if you have 100 DAI, and you had ETH down as collateral, you can trade your DAI in for $100 in ETH via a smart contract. Boom! Now that we have a (roughly) permanent exchange for the currency where the price of one DAI is always $1.\n  \n  **Pegged Asset Examples**: DAI, USDC, USDT, FRAX, UST\n  \n  Floating\n  --------\n  \n  A token can go the “non-volatile” route and follow a “pseudo-index” like route and create a stablecoin whose buying power stays relatively the same over time — without it being pegged to another asset. Relatively speaking, the coin would still be stable by very slowly following current market conditions, but is resistant to the quick spikes and dumps of the market. You could think of a floating stablecoin as an oobleck-like substance, but in the financial market. It’s firm when markets are volatile, but liquid when change comes slowly.\n  \n  Another analogy is a board “pegged” to a dock vs. a buoy “floating” by a dock compared to the water. The “pegged” board might seem more stable at first, but when the tide is in, the pegged board is underwater and the buoy is still floating in the same position.\n  \n  Coins like [RAI](https://reflexer.finance/) follow this principle. They “float” around a price that very slowly follows the market, trying to keep the buying power of the coin the same at all times.\n  \n  A non-pegged token might be difficult to wrap your mind around but just remember, in order to be a stablecoin its buying power just has to be relatively stable. So a coin that fluctuates around $2.10 always, could be considered a stablecoin even though it is worth a weird amount of dollars.\n  \n  You could even have a floating stablecoin be _more_ stable than a dollar-pegged coin, for example:\n  \n  If 1 Cheesecake in 2018 is worth $45 and 1 cheesecake is worth $55 in 2022, one could say the buying power of the dollar went down by ~20% in those four years. [Inflation](https://www.forbes.com/advisor/investing/what-is-inflation/) (CPI) is usually a good measurement of the instability of the dollar. If we had a coin (let’s say “Cheesecake Coin”) that could buy 1 cheesecake for 1 Cheesecake Coin in 2018 and 2022, the buying power of that coin stayed the same across the four years, making it a relatively more stable stablecoin than a dollar-pegged one.\n  \n  Anyways…\n  \n  I won’t get into the mechanics of a coin like RAI here, as it’s pretty difficult to explain how they work without getting into the other properties of the coin. We will explain RAI more later on.\n  \n  And will we be talking more about those in this article? You bet we will.\n  \n  **Floating Asset Examples:** RAI\n  \n  An Example\n  ----------\n  \n  To further clarify the difference, let’s take a buoy and an anchor as examples.\n  \n  If you asked “is the anchor or the buoy more stable” how would you answer? Well, it depends on what you need it stable for.\n  \n  If you’re looking for stable in relation to the ocean floor, the anchor is more stable. But if you’re looking for stable related to sea level, the buoy is more stable.\n  \n  This a solid pegged vs. floating analogy. One may go further with the analogy and ask “what happens when a temporary storm comes, wouldn’t the buoy start rocking all over the place and going up and down, making it not stable?” To that I’d say, yes. This is why a lot of protocols like RAI account for that with built-in mechanisms to slow down rapid temporary changes. Imagine a buoy that stays at sea level, unless there is a storm. A “magic buoy” in a weird sense\n  \n  You might even ask “well, isn’t the buoy sort of anchored then, since it needs to be tied down somewhere to stay in the same place?” To that I’d also say yes. A stablecoin that keeps its buying power can be thought of almost as an asset that tracks a sort of consumer index, or the long-term market movements of its underlying collateral. But we might be going a little too far down the analogy rabbit hole.\n  \n  Stability Method\n  ================\n  \n  The stability method is the way the coin stays stable. It is on a spectrum of algorithmic to governed, where either it’s 100% automated by an algorithm, or it has some form of human intervention.\n  \n  Algorithmic\n  -----------\n  \n  An algorithmic stablecoin is any coin that uses an automated algorithm that, usually, mints or burns tokens in a specific way to keep stability.\n  \n  The stability method could also be called the “supply mechanism” or “mint and burn” mechanism since they are so closely tied. These algorithms can also vary a LOT in how they are implemented. Rebasing, supply and demand games, and other oracle-based ventures are all different algorithms that many stablecoins use today.\n  \n  **Algorithmic Examples:** DAI, FRAX, RAI, UST\n  \n  Governed\n  --------\n  \n  A governed stablecoin is one where a central issuer chooses when to mint and burn tokens. Now, this could be put to the extreme, where one person is doing the minting and burning, but it could be more algorithmic if there is perhaps a DAO voting on when to mint and burn. The Maker protocol is a fantastic example of how an algorithmic stablecoin can have a lot of governed properties — since the DAO controls so much of how the protocol operates.\n  \n  A lot of times, centralized stablecoins are easily in the governed category, since a single off-chain entity controls their minting and burning.\n  \n  **Governed Examples:** USDC, USDT, TUSD\n  \n  Summary\n  -------\n  \n  A token can have both algorithmic and governed mechanisms, and be on the spectrum of being more decentralized and algorithmic to more centralized and governed. With this definition, the DAI token would fall into the algorithmic category. USDC would fall into the governed category, being a deeply centralized stablecoin. Traditionally-thought algorithmic coins like the original LUNA/UST would also be considered algorithmic.\n  \n  [The Dirt Roads](https://dirtroads.substack.com/p/-40-pruning-memes-algo-stables-are) article gives a great visualization of popular stablecoins and where they are on this spectrum. He uses “dumb” as the opposite of Algorithmic, which I don’t think is a bad replacement for governed.\n  \n  The part we haven’t discussed is his **anchored** vs. **reflexive** spectrum. However, that comes next in the collateral section.\n  \n  If we look at classically categorized “fiat-collateralized” stablecoins, they almost all fall into the “governed” side of minting mechanisms, since some single entity is doing the minting. Crypto-collateralized tokens like DAI have a governance process but are _more_ algorithmic in the algorithmic-governed spectrum.\n  \n  Collateral Type\n  ===============\n  \n  The final and most important categorization of stablecoins is their collateral type. There are two types of collateral that protocols use, ranging on a spectrum once again, **endogenous** and **exogenous**.\n  \n  Now, these two collateral types can be a little tricky to define, but as a test, you can ask:\n  \n  If the stablecoin fails, does the underlying collateral also fail?\n  \n  If yes, it’s endogenous; if no, it’s exogenous. Endogenous roughly means the collateral is embedded within the protocol, and exogenous means the collateral is completely different from the protocol. Some other good tests that people use are:\n  \n  *   If the collateral was created for the sole purpose of being collateral\n  *   If the protocol owns the issuance of the underlying collateral\n  \n  **Exogenous Example:** ETH is collateral for the DAI token. If DAI fails, does ETH fail? No, ETH still has smart contract uses outside of DAI and will continue to thrive. Therefore, the ETH collateral is **exogenous**.\n  \n  **Endogenous Example:** Very roughly, the underlying collateral of UST was LUNA. In order to mint UST, you needed to burn LUNA, and vice versa. They were designed together at the protocol level, so very “in-bed” together. If UST failed does LUNA fail? Well, this was already proven to be true, so UST had **endogenous** collateral of LUNA.\n  \n  It’s this endogenous scheme that most people are afraid of when they traditionally refer to algorithmic stablecoins.\n  \n  Most stablecoin protocols are 1:1 or overcollateralized, meaning they have more underlying value backing the stablecoin than the total sum of the assets minted, whereas endogenous collateralized protocols can often be undercollateralized. FRAX is interesting in that it has a sliding scale of collateral, and is partially undercollateralized. It can become more exogenous or endogenous depending on current market conditions. The image below illustrates FRAX, DAI (MakerDAO), and UST (Terra).\n  \n  **Endogenous Examples:** FRAX (sort of), UST\n  \n  **Exogenous Examples:** DAI, USDC, RAI\n  \n  Some Top Stablecoins\n  ====================\n  \n  DAI\n  ---\n  \n  The DAI token is one of the most influential tokens in crypto and is often cited for being the protocol that really kicked off the DeFi craze. DAI was revolutionary as it allowed more sophisticated financial products to emerge on the DeFi scene.\n  \n  The DAI stablecoin is a pegged, algorithmic, exogenous collateral stablecoin. Now remember, it’s technically algorithmic, but it does have a governance process based on the MKR token and the interest rates of minting DAI, so it’s on a scale of algorithmic to governed. It’s actually a lot closer than you’d think. And now that voting proposals have passed to even allow [off-chain collateral into the system](https://cryptobriefing.com/makerdao-votes-to-loan-dai-to-us-bank/), the system has moved farther from the algorithmic mark.\n  \n  Normally, the way DAI is created is that a user deposits some collateral, like ETH, into a smart contract. Then using an [oracle](https://chain.link/education/blockchain-oracles), you are given DAI that in total is less than the amount of ETH you put up as collateral.\n  \n  For example, I put down 1 ETH, and at the time, 1 ETH is $1,000. I can then mint 500 DAI. I always have to mint less DAI than I have collateral down, hence DAI being an **over-collateralized** system. The collateral of DAI is exogenous because it’s things like ETH and other cryptos that don’t need DAI to exist. One could argue though, that if DAI goes down, the value of ETH would go down too, so on a sliding scale, they are at least a tiny bit endogenous.\n  \n  When I mint my DAI, I get charged a continuous stability fee to do so — usually around 2% a year. With this in mind, anyone who holds DAI is really holding someone else’s debt. Every year whoever minted the DAI is charged 2% for you to hold the DAI you have. This is why a lot of people talk about DAI as “debt” or “a loan.”\n  \n  Now if your collateral falls below a certain threshold (usually, something around 200% of the value of DAI you minted) you can get what’s called [liquidated](https://itovault.com/how-dai-liquidation-work-makerdaos-mcd-system/). This is DAI’s solvency policy, to make sure it never has less money as collateral than DAI in the world. Essentially, if your balance of collateral falls too low, someone else can pay back the DAI you minted and get some of your collateral at a discount. So others are heavily incentivized to pay back your DAI loan if you default!\n  \n  Keep this in mind as we go through these stablecoins. Most currencies are a form of debt.\n  \n  USDC\n  ----\n  \n  [USDC](https://www.centre.io/usdc) is the coin behind the joint venture of [Circle](https://www.circle.com/en/) and [Coinbase](https://www.coinbase.com/home) and is a 100% centralized coin. The team behind the coin can blacklist users and is governed 100% off-chain.\n  \n  The token is pegged to the dollar and is supposed to be backed 1:1. For every one USDC coin, there is one US dollar in a bank somewhere. Sometimes, they invest these dollars in other assets, so it might not even be backed by dollars but anything, like real estate, stocks, bonds, etc.\n  \n  There are many tokens that have nearly identical setups to USDC, a centralized entity minting and burning tokens, pegged to the dollar, saying their tokens are backed 1:1 with US dollars. Protocols like USDT, TUSD, and GUSD all follow this blueprint.\n  \n  FRAX\n  ----\n  \n  Now that we know more, we can take a look at more stablecoins and start to understand them more quickly. [FRAX](https://frax.finance/) uses its FLX governance token as part of its collateral as well as other tokens, and is known for being undercollateralized. This makes the token slightly endogenous since one of the underlying collaterals (FLX) would collapse if the FRAX system collapsed. It’s pegged to the dollar, and is algorithmic in nature, with some governance from the FLX token.\n  \n  FRAX is our first token on the list to implement a version of the [seigniorage shares](https://blog.bitmex.com/wp-content/uploads/2018/06/A-Note-on-Cryptocurrency-Stabilisation-Seigniorage-Shares.pdf), but is still collateralized and uses a lot of exogenous collateral as well to prevent what happened with UST. What’s especially interesting about FRAX, is that the amount of exogenous vs endogenous collateral it needs can shift, based on how risky the protocol is at the moment.\n  \n  UST (With the Original LUNA)\n  ----------------------------\n  \n  Now we know UST collapsed, but it’s important to reflect on this stablecoin as a cautionary tale of what can happen with algorithmic endogenous coins. UST was a seigniorage shares type coin with LUNA absorbing the volatility so UST could stay stable.\n  \n  It ended up imploding on itself, as once the UST token lost its peg, more LUNA shares were minted to try to find the peg again when people redeemed their UST for LUNA just as in Robert Sams’ paper. However, as a LUNA holder, you don’t love the idea of more LUNA being minted, since that reduces the price of your LUNA, so if you see the UST peg falling, you start dumping your LUNA. This makes the total collateral of UST fall, meaning the UST loses its peg, meaning more LUNA is minted. More LUNA minted means more LUNA holders panic selling, which means UST losing its peg, which means more LUNA minting, which means more…\n  \n  Do you see the issue here?\n  \n  With the circular logic of endogenous tokens, there is a massive risk of these algorithmic systems working correctly. We say that UST/LUNA was **reflexive** in this sense since the value of the protocol was based on itself.\n  \n  RAI\n  ---\n  \n  [RAI](https://reflexer.finance/) is one of the few stablecoins that is not pegged to another asset. It was originally up for governance on the DAI project but the Maker group decided to move forward with the protocol as we know it today, so many took off wanting to see improvements like:\n  \n  1.  Less governance\n  2.  No peg\n  3.  More “pure” collateral\n  \n  If we want DeFi to stand on its own two feet, it would make sense that we wouldn’t peg our currency to the world’s nation-states. Additionally, the more governance in a protocol, the less algorithmic and trust-minimized it is. The purpose of web3 is to make transparent trust-minimized systems, and every piece of governance introduced is another piece that needs to be trusted.\n  \n  Without going too deep into the mechanics of RAI, RAI is a coin that focuses on two prices, the market price of the coin, and the redemption price. The market price of RAI is the price people are buying and selling the coin at, and the redemption price is how much the protocol will buy your coin for. If the market price of the coin is too high, essentially the redemption price drops, and if the market price is too low, essentially the redemption price rises. This is how the coin is able to keep relatively stable buying power.\n  \n  You can [learn more about it here](https://medium.com/reflexer-labs/stability-without-pegs-8c6a1cbc7fbd) or, in [this video](https://www.youtube.com/watch?v=wyr297JjEGY) which breaks it down with visuals. Essentially, RAI works similarly to DAI with users depositing ETH to get RAI minted, but the difference is that RAI isn’t pegged to a dollar. It instead uses supply and demand forces (via a sort of interest rate) to create or suppress demand, and has the value of the token very slowly follow where the market goes. This means, your buying power with RAI stays relatively the same over the course of time.\n  \n  USD (the US Dollar)\n  -------------------\n  \n  “Hold the phone, Patrick. The US Dollar isn’t a stablecoin!”\n  \n  Yes, you’re right, but using the categorizations we came up with above, they actually apply to _all_ stable-type assets, and the dollar is one of those. And it’s interesting to compare because we want to make a world in Web3 that is better than our current system in Web2.\n  \n  The easiest category to get correct is its stability — which is 100% governed. Sure they might use some algorithms behind closed doors to decide how much to print, but the monetary policy of the dollar is up to the US government, full stop.\n  \n  Now collateral is particularly interesting, as the dollar was once backed by gold, but [taken off the “gold standard” in the 1970s.](https://owninggold.com/gold-standard/) Now, one US dollar is worth… one US dollar, which means the dollar is reflexive, and arguably, endogenous in nature.\n  \n  However, you could argue the answer is no, and that the US dollar is backed by other national assets (political, military, technological, and geographic resources), which would make it exogenous.\n  \n  So sometimes, it can be hard to tell what an asset is backed by.\n  \n  Which Stablecoin Is Best?\n  =========================\n  \n  There isn’t one: each has its tradeoffs.\n  \n  Each stablecoin makes design choices that make them widely different from each other but accomplish similar things. There isn’t a “best” system, and we are seeing the industry constantly change.\n  \n  Who Is Paying for Stablecoins?\n  ==============================\n  \n  Now that we have all this background information, we can get to the good stuff.\n  \n  These stablecoins aren’t just popping up out of nowhere. Someone is making money off their creation. I told you at the start of the article that stablecoins are important because we need a medium of exchange, store of value, and unit of accounts — however, this is for the average person. I also said that stablecoins like DAI are a form of debt: someone is taking on the debt to get these good currencies into circulation. This means that the incentive to mint these stablecoins better be really good.\n  \n  Let’s talk about that.\n  \n  Creation of Currency (Debt)\n  ===========================\n  \n  Now, the exact date that [currency was created](https://en.wikipedia.org/wiki/History_of_money) is debated, but we can imagine it went something like this.\n  \n  Person A: Hey, I’ll trade you 10 carrots for 50 tomatoes\n  \n  Person B: Sounds good, but hey my tomatoes are back at my house. Can I give you these 50 signed rocks as a promise to get you the tomatoes?\n  \n  Person A: Sure\n  \n  Boom. 50 signed rocks are now money. 1 signed rock = 1 tomato from Person B.\n  \n  Person A can now run around and trade these 50 IOU rocks for other stuff around the village. These IOU rocks though represent debt; they are the debt of Person B. At some point, person B needs to fulfill their debt (i.e. give the holder of a signed rock 1 tomato).\n  \n  In the DeFi and stablecoin world, creating stablecoins works the exact same way. When you mint DAI, RAI, or most other stablecoins, they represent debt that you need to pay back to the system at some point, otherwise risk constantly paying interest.\n  \n  Oddly enough, you could make the same argument that US dollars are debt, but the [argument gets a lot more complicated.](https://www.quora.com/Is-the-US-dollar-debt?share=1) Some might even argue that [all money is debt.](https://mises.org/library/our-money-based-debt)\n  \n  Creation of Stablecoins\n  -----------------------\n  \n  So, if in order for me to create a stablecoin, I need to take on this debt, why would I want to do this? Not only that, but most of the minting of these stablecoins or swapping the stablecoins for their collateral has some sort of fee associated with it! If we look at one of the [most popular DAI minting vaults](https://oasis.app/vaults/open-multiply/ETH-B), we see a fee over 2%! If we look at RAI, [we see it’s over 0.1%](https://app.reflexer.finance/#/)! Even USDC and USDT need to pay fees to swap your dollars and their tokens.\n  \n  This means that whoever creates DAI, RAI, etc is paying a little extra. If I want $100 in DAI, I need to put down over $100 in collateral and pay maybe $2 in fees! Why would anyone do this? The normal users can’t be doing this, since spending $2 to get some silly stablecoin doesn’t seem worth it. So who is minting these coins?\n  \n  Well, this leads me to what I think is the most important part of this whole article.\n  \n  Stablecoins are not minted because we need a good medium of exchange, unit of account, and storage of value. They cost money to mint. Stablecoins are instead created for sophisticated investors to take leveraged bets or earn subsidized yields.\n  \n  It’s funny.\n  \n  Why are stablecoins good? -> Because we need currency!\n  \n  Why are stablecoins minted? -> Because investors want to make leveraged bets.\n  \n  Final Thoughts\n  ==============\n  \n  A lot of people look at stablecoins and think there is a [trilemma](https://stablecoins.wtf/resources/the-stablecoin-trillema) at play.\n  \n  A stablecoin can be two of the three. I’m not so sure I agree with this trilemma, but we are still working it out.\n  \n  Stablecoins are an incredibly important piece of making sure Web3 works. We need a token that people can transact in without the spikes and volatility of native blockchain assets.\n  \n  There is a lot of work to be done. I’ve started by creating a [DeFi-minimal repo](https://github.com/smartcontractkit/defi-minimal/tree/main/contracts/stablecoins) with some stablecoin architectures that you can take a look at and hopefully learn from. As of now, we have a pegged, governed, exogenous coin and a pegged, algorithmic, exogenous coin for minimal examples.\n  \n  Hopefully, we can get some more examples in there, and devs can build something even better.\n  \n  Thanks all, hope you learned a lot here.\n  ",
  "name": "What Is a Stablecoin? (But Actually)",
  "image": "ipfs://QmQBxgAbbHqZMTQYyGE44siuZ6BzQGeHt3vGHCENpj3TEv",
  "version": "2.0.0",
  "metadata_id": "ad436b9e-2cbb-4140-b199-368533c4b88d",
  "locale": "en-US",
  "mainContentFocus": "ARTICLE",
  "imageMimeType": "image/png",
  "appId": "lensBlog",
  "attributes": []
}